import 'app_localizations.dart';

/// The translations for Panjabi Punjabi (`pa`).
class AppLocalizationsPa extends AppLocalizations {
  AppLocalizationsPa([String locale = 'pa']) : super(locale);

  @override
  String get homeHeading => 'ਸਿਰ ਸਕੈਨ';

  @override
  String get boxCContact => 'ਸੰਪਰਕ ਕਰੋ';

  @override
  String get boxcontent => 'ਕਿਸੇ ਵੀ ਪੁੱਛਗਿੱਛ ਜਾਂ ਸਹਾਇਤਾ ਲਈ, ਕਿਰਪਾ ਕਰਕੇ ਈਮੇਲ ਰਾਹੀਂ ਸਾਡੇ ਨਾਲ ਸੰਪਰਕ ਕਰਨ ਲਈ ਬੇਝਿਜਕ ਮਹਿਸੂਸ ਕਰੋ। ਸਾਡੀ ਟੀਮ ਤੁਰੰਤ ਤੁਹਾਡੇ ਨਾਲ ਸੰਪਰਕ ਕਰੇਗੀ। ਸਾਡੀ ਐਪ ਦੀ ਵਰਤੋਂ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ!';

  @override
  String get boxmailus => 'ਸਾਨੂੰ ਮੇਲ ਕਰੋ';

  @override
  String get boxcancel => 'ਬੰਦ ਕਰੋ';

  @override
  String get homeBody1 => 'ਸਿਰ ਸਕੈਨ ਪੋਲਟਰੀ ਸਿਹਤ ਪ੍ਰਬੰਧਨ ਲਈ ਤਿਆਰ ਕੀਤਾ ਗਿਆ ਇੱਕ ਨਵੀਨਤਾਕਾਰੀ ਐਪ ਹੈ. ਇਹ ਕੋਕਸੀਡਿਓਸਿਸ, ਸਾਲਮੋਨੇਲਾ, ਨਿਊਕੈਸਲ ਬਿਮਾਰੀ, ਜਾਂ ਪੋਲਟਰੀ ਦੀ ਸਿਹਤ ਸਥਿਤੀ ਦਾ ਮੁਲਾਂਕਣ ਕਰਨ ਲਈ ਪ੍ਰਚਲਿਤ ਬਿਮਾਰੀਆਂ ਦੀ ਭਵਿੱਖਬਾਣੀ ਕਰਨ ਲਈ ਫੇਕਲ ਚਿੱਤਰ ਵਿਸ਼ਲੇਸ਼ਣ ਦੀ ਵਰਤੋਂ ਕਰਦਾ ਹੈ।';

  @override
  String get homeBody2 => 'HenScan ਦਾ ਉਦੇਸ਼ ਮੁਰਗੀ ਪਾਲਣ ਦੇ ਕਿਸਾਨਾਂ ਅਤੇ ਪਸ਼ੂਆਂ ਦੇ ਡਾਕਟਰਾਂ ਨੂੰ ਸ਼ੁਰੂਆਤੀ ਬਿਮਾਰੀਆਂ ਦੀ ਪਛਾਣ ਅਤੇ ਕਿਰਿਆਸ਼ੀਲ ਪੋਲਟਰੀ ਸਿਹਤ ਪ੍ਰਬੰਧਨ ਲਈ ਇੱਕ ਪਹੁੰਚਯੋਗ ਅਤੇ ਕੁਸ਼ਲ ਸਾਧਨ ਪ੍ਰਦਾਨ ਕਰਕੇ ਸ਼ਕਤੀ ਪ੍ਰਦਾਨ ਕਰਨਾ ਹੈ।';

  @override
  String get homeBody3 => 'ਉਪਭੋਗਤਾ ਇੱਕ ਚਿੱਤਰ ਨੂੰ ਕੈਪਚਰ ਕਰਨ ਲਈ ਕਲਿਕ ਕਰ ਸਕਦੇ ਹਨ ਅਤੇ ਤਤਕਾਲ ਪੂਰਵ-ਅਨੁਮਾਨ ਪ੍ਰਾਪਤ ਕਰ ਸਕਦੇ ਹਨ, ਬਿਮਾਰੀ ਦੀ ਖੋਜ ਅਤੇ ਰੋਕਥਾਮ ਉਪਾਵਾਂ ਲਈ ਇੱਕ ਸੁਚਾਰੂ ਅਨੁਭਵ ਦੀ ਪੇਸ਼ਕਸ਼ ਕਰਦੇ ਹੋਏ।';

  @override
  String get homeBody4 => 'ਐਪ ਦੀ ਵਰਤੋਂ ਕਿਵੇਂ ਕਰੀਏ';

  @override
  String get homeBody5 => '1. ਕੈਪਚਰ ਕਰੋ: ਪੋਲਟਰੀ ਦੇ ਮਲ ਦੇ ਨਮੂਨੇ ਦੀ ਤਸਵੀਰ ਲੈਣ ਲਈ ਕੈਮਰਾ ਆਈਕਨ \'ਤੇ ਟੈਪ ਕਰੋ';

  @override
  String get homeBody6 => '2. ਭਵਿੱਖਬਾਣੀ ਕਰੋ: ਪੋਲਟਰੀ ਦੀ ਸਿਹਤ ਸਥਿਤੀ ਦੇ ਸੰਬੰਧ ਵਿੱਚ ਇੱਕ ਤਤਕਾਲ ਵਿਸ਼ਲੇਸ਼ਣ ਅਤੇ ਭਵਿੱਖਬਾਣੀ ਪ੍ਰਾਪਤ ਕਰਨ ਲਈ ਭਵਿੱਖਬਾਣੀ ਬਟਨ \'ਤੇ ਕਲਿੱਕ ਕਰੋ';

  @override
  String get instructionScreenHeading => 'ਹਦਾਇਤਾਂ';

  @override
  String get instructionScreenBody => '1. ਹੇਠਾਂ \'ਅੱਗੇ\' ਬਟਨ \'ਤੇ ਕਲਿੱਕ ਕਰਨ \'ਤੇ, ਤੁਹਾਨੂੰ ਚਿੱਤਰ ਕੈਪਚਰ ਕਰਨ ਲਈ ਇੱਕ ਕੈਮਰਾ ਬਟਨ ਜਾਂ ਤੁਹਾਡੀ ਗੈਲਰੀ ਤੋਂ ਅੱਪਲੋਡ ਕਰਨ ਲਈ ਇੱਕ ਵਿਕਲਪ ਦੀ ਵਿਸ਼ੇਸ਼ਤਾ ਵਾਲੀ ਇੱਕ ਸਕ੍ਰੀਨ ਵੱਲ ਨਿਰਦੇਸ਼ਿਤ ਕੀਤਾ ਜਾਵੇਗਾ।\n\n 2. ਭਵਿੱਖਬਾਣੀ ਦੀ ਸ਼ੁੱਧਤਾ ਨੂੰ ਵਧਾਉਣ ਲਈ, ਯਕੀਨੀ ਬਣਾਓ ਕਿ ਕੈਪਚਰ ਕੀਤੇ ਜਾਂ ਅੱਪਲੋਡ ਕੀਤੇ ਚਿੱਤਰ ਵਿੱਚ ਫੇਕਲ ਟਿਕਾਣਾ ਫ੍ਰੇਮ ਦੇ ਅੰਦਰ ਕੇਂਦਰਿਤ ਹੈ।\n\n 3. ਨੋਟ ਕਰੋ ਕਿ ਜੇਕਰ ਐਪ ਇੱਕ ਗੈਰ-ਫੇਕਲ ਚਿੱਤਰ ਨਾਲ ਪੇਸ਼ ਕੀਤੀ ਜਾਂਦੀ ਹੈ, ਤਾਂ ਇਹ ਅਜੇ ਵੀ ਇੱਕ ਪੂਰਵ ਅਨੁਮਾਨ ਪੈਦਾ ਕਰ ਸਕਦੀ ਹੈ, ਪਰ ਸ਼ੁੱਧਤਾ ਦੀ ਗਰੰਟੀ ਨਹੀਂ ਦਿੱਤੀ ਜਾ ਸਕਦੀ ਹੈ। ਉਪਭੋਗਤਾਵਾਂ ਨੂੰ ਭਰੋਸੇਮੰਦ ਬਿਮਾਰੀ ਦੀ ਪਛਾਣ ਲਈ ਸਿਰਫ ਪੋਲਟਰੀ ਮਲ ਦੀਆਂ ਤਸਵੀਰਾਂ ਨੂੰ ਅਪਲੋਡ ਕਰਨ ਲਈ ਉਤਸ਼ਾਹਿਤ ਕੀਤਾ ਜਾਂਦਾ ਹੈ।';

  @override
  String get instructionScreenNext => 'ਅਗਲਾ';

  @override
  String get clickImagePageHeading => 'ਪੋਲਟਰੀ ਬਿਮਾਰੀ ਦੀ ਭਵਿੱਖਬਾਣੀ ਕਰੋ';

  @override
  String get clickImage => 'ਪੋਲਟਰੀ ਫੇਕਲ ਚਿੱਤਰ \'ਤੇ ਕਲਿੱਕ ਕਰੋ';

  @override
  String get uploadimage => 'ਗੈਲਰੀ ਤੋਂ ਪੋਲਟਰੀ ਫੇਕਲ ਚਿੱਤਰ ਚੁਣੋ';

  @override
  String get predictButton => 'ਅੰਦਾਜ਼ਾ';

  @override
  String get pstitle => 'ਭਵਿੱਖਬਾਣੀ';

  @override
  String get cabout => 'ਕੋਕਸੀਡਿਓਸਿਸ ਇੱਕ ਆਂਤੜੀਆਂ ਦੀ ਲਾਗ ਹੈ ਜੋ ਕੋਕਸੀਡੀਆ ਨਾਮਕ ਸੂਖਮ ਪਰਜੀਵੀਆਂ ਦੁਆਰਾ ਹੁੰਦੀ ਹੈ। ਇਹ ਬਿੱਲੀਆਂ, ਕੁੱਤਿਆਂ, ਪੰਛੀਆਂ ਅਤੇ ਪਸ਼ੂਆਂ ਸਮੇਤ ਵੱਖ-ਵੱਖ ਜਾਨਵਰਾਂ ਨੂੰ ਪ੍ਰਭਾਵਿਤ ਕਰ ਸਕਦਾ ਹੈ। ਇਹ ਦਸਤ, ਭਾਰ ਘਟਾਉਣ, ਡੀਹਾਈਡਰੇਸ਼ਨ ਅਤੇ ਅਨੀਮੀਆ ਦਾ ਕਾਰਨ ਬਣ ਸਕਦਾ ਹੈ।';

  @override
  String get cothersymptoms => '\n\n ਹੋਰ ਲੱਛਣ \n\n ਪੰਛੀਆਂ ਵਿੱਚ ਕੋਕਸੀਡਿਓਸਿਸ ਦੇ ਕੁਝ ਹੋਰ ਲੱਛਣਾਂ ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਟੱਟੀ ਵਿੱਚ ਖੂਨ ਜਾਂ ਬਲਗ਼ਮ, ਪੇਟ ਵਿੱਚ ਦਰਦ, ਉਲਟੀਆਂ, ਬੁਖਾਰ, ਸੁਸਤੀ ਅਤੇ ਭੁੱਖ ਘੱਟ ਲੱਗਣਾ। ਲੱਛਣ ਆਮ ਤੌਰ \'ਤੇ ਐਕਸਪੋਜਰ ਤੋਂ ਬਾਅਦ ਇੱਕ ਤੋਂ ਤਿੰਨ ਹਫ਼ਤਿਆਂ ਦੇ ਅੰਦਰ ਦਿਖਾਈ ਦਿੰਦੇ ਹਨ ਅਤੇ ਦੋ ਤੋਂ ਚਾਰ ਹਫ਼ਤਿਆਂ ਤੱਕ ਰਹਿੰਦੇ ਹਨ।';

  @override
  String get ccure => '\n\n ਇਲਾਜ \n\nਕੋਕਸੀਡਿਓਸਿਸ ਦਾ ਕੋਈ ਖਾਸ ਇਲਾਜ ਨਹੀਂ ਹੈ, ਪਰ ਕੁਝ ਦਵਾਈਆਂ ਲਾਗ ਦੀ ਤੀਬਰਤਾ ਅਤੇ ਮਿਆਦ ਨੂੰ ਘਟਾਉਣ ਵਿੱਚ ਮਦਦ ਕਰ ਸਕਦੀਆਂ ਹਨ। ਇਹਨਾਂ ਵਿੱਚ ਸਲਫੋਨਾਮਾਈਡਸ, ਐਮਪ੍ਰੋਲੀਅਮ, ਅਤੇ ਟੋਲਟਰਾਜ਼ੁਰਿਲ ਸ਼ਾਮਲ ਹਨ। ਇਹ ਦਵਾਈਆਂ ਆਮ ਤੌਰ \'ਤੇ ਪੰਜ ਤੋਂ ਦਸ ਦਿਨਾਂ ਲਈ ਜ਼ੁਬਾਨੀ ਦਿੱਤੀਆਂ ਜਾਂਦੀਆਂ ਹਨ।';

  @override
  String get cprevent => '\n\n ਰੋਕਥਾਮ ਲਈ ਸਾਵਧਾਨੀਆਂ \n\n ਕੋਕਸੀਡਿਓਸਿਸ ਨੂੰ ਰੋਕਣ ਜਾਂ ਨਿਯੰਤਰਿਤ ਕਰਨ ਲਈ ਕੁਝ ਸਾਵਧਾਨੀਆਂ ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਵਾਤਾਵਰਣ ਨੂੰ ਸਾਫ਼ ਅਤੇ ਖੁਸ਼ਕ ਰੱਖਣਾ, ਤੁਰੰਤ ਮਲ ਨੂੰ ਹਟਾਉਣਾ, ਪਿੰਜਰਿਆਂ ਅਤੇ ਉਪਕਰਣਾਂ ਨੂੰ ਰੋਗਾਣੂ ਮੁਕਤ ਕਰਨਾ, ਤਾਜ਼ਾ ਪਾਣੀ ਅਤੇ ਭੋਜਨ ਪ੍ਰਦਾਨ ਕਰਨਾ, ਭੀੜ-ਭੜੱਕੇ ਅਤੇ ਤਣਾਅ ਤੋਂ ਬਚਣਾ, ਅਤੇ ਜਾਨਵਰਾਂ ਦਾ ਟੀਕਾਕਰਨ ਕਰਨਾ। ਜੇ ਉਪਲਬਧ ਹੋਵੇ.';

  @override
  String get cnote => '\n\n ਨੋਟ: \n\n ਕੁਝ ਰੋਕਥਾਮ ਉਪਾਵਾਂ ਜੋ ਮਨੁੱਖਾਂ ਨੂੰ ਪੋਲਟਰੀ ਤੋਂ ਕੋਕਸੀਡਿਓਸਿਸ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਨਾ ਹੋਣ ਲਈ ਕਰਨੀਆਂ ਚਾਹੀਦੀਆਂ ਹਨ, ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਪੋਲਟਰੀ ਘਰਾਂ ਦੀ ਸਫਾਈ ਕਰਦੇ ਸਮੇਂ ਦਸਤਾਨੇ ਅਤੇ ਬੂਟ ਪਹਿਨਣੇ, ਪੋਲਟਰੀ ਜਾਂ ਉਨ੍ਹਾਂ ਦੇ ਮਲ ਨੂੰ ਸੰਭਾਲਣ ਤੋਂ ਬਾਅਦ ਹੱਥ ਧੋਣਾ, ਪੋਲਟਰੀ ਮੀਟ ਅਤੇ ਅੰਡੇ ਪਕਾਉਣਾ। ਚੰਗੀ ਤਰ੍ਹਾਂ, ਅਤੇ ਬਿਮਾਰ ਜਾਂ ਮਰੇ ਹੋਏ ਪੰਛੀਆਂ ਦੇ ਸੰਪਰਕ ਤੋਂ ਪਰਹੇਜ਼ ਕਰੋ।';

  @override
  String get sabout => '\n ਪੋਲਟਰੀ ਵਿੱਚ ਸਾਲਮੋਨੇਲਾ ਇੱਕ ਬੈਕਟੀਰੀਆ ਦੀ ਲਾਗ ਹੈ ਜੋ ਮੁਰਗੀਆਂ ਅਤੇ ਹੋਰ ਪੰਛੀਆਂ ਦੇ ਅੰਤੜੀਆਂ ਨੂੰ ਪ੍ਰਭਾਵਿਤ ਕਰਦੀ ਹੈ। ਇਹ ਦਸਤ, ਬੁਖਾਰ, ਅਤੇ ਅੰਡੇ ਦੇ ਉਤਪਾਦਨ ਨੂੰ ਘਟਾ ਸਕਦਾ ਹੈ। ਇਹ ਦੂਸ਼ਿਤ ਅੰਡੇ ਜਾਂ ਮਾਸ ਦੇ ਸੇਵਨ ਦੁਆਰਾ ਵੀ ਮਨੁੱਖਾਂ ਵਿੱਚ ਸੰਚਾਰਿਤ ਹੋ ਸਕਦਾ ਹੈ।';

  @override
  String get sothersymptoms => '\n\n ਹੋਰ ਲੱਛਣ \n\n ਪੋਲਟਰੀ ਵਿੱਚ ਸਾਲਮੋਨੇਲਾ ਦੇ ਕੁਝ ਹੋਰ ਲੱਛਣਾਂ ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਭੁੱਖ ਨਾ ਲੱਗਣਾ, ਡੀਹਾਈਡਰੇਸ਼ਨ, ਡਿਪਰੈਸ਼ਨ, ਝੁਰੜੀਆਂ ਵਾਲੇ ਖੰਭ, ਝੁਲਸਣਾ, ਅਤੇ ਮੌਤ ਦਰ ਵਿੱਚ ਵਾਧਾ। ਲੱਛਣ ਆਮ ਤੌਰ \'ਤੇ ਐਕਸਪੋਜਰ ਤੋਂ ਬਾਅਦ 12 ਤੋਂ 72 ਘੰਟਿਆਂ ਦੇ ਅੰਦਰ ਦਿਖਾਈ ਦਿੰਦੇ ਹਨ ਅਤੇ ਕਈ ਦਿਨਾਂ ਤੱਕ ਰਹਿੰਦੇ ਹਨ।';

  @override
  String get scure => '\n\n ਇਲਾਜ \n\n ਪੋਲਟਰੀ ਵਿੱਚ ਸਾਲਮੋਨੇਲਾ ਦਾ ਕੋਈ ਖਾਸ ਇਲਾਜ ਨਹੀਂ ਹੈ, ਪਰ ਕੁਝ ਐਂਟੀਬਾਇਓਟਿਕਸ ਲਾਗ ਦੀ ਤੀਬਰਤਾ ਅਤੇ ਮਿਆਦ ਨੂੰ ਘਟਾਉਣ ਵਿੱਚ ਮਦਦ ਕਰ ਸਕਦੇ ਹਨ। ਹਾਲਾਂਕਿ, ਐਂਟੀਬਾਇਓਟਿਕਸ ਦੀ ਵਰਤੋਂ ਸਾਵਧਾਨੀ ਨਾਲ ਕੀਤੀ ਜਾਣੀ ਚਾਹੀਦੀ ਹੈ, ਕਿਉਂਕਿ ਉਹ ਐਂਟੀਬਾਇਓਟਿਕ-ਰੋਧਕ ਤਣਾਅ ਦੇ ਵਿਕਾਸ ਨੂੰ ਵੀ ਉਤਸ਼ਾਹਿਤ ਕਰ ਸਕਦੇ ਹਨ। ਪੋਲਟਰੀ ਵਿੱਚ ਸਾਲਮੋਨੇਲਾ ਦੀਆਂ ਘਟਨਾਵਾਂ ਨੂੰ ਰੋਕਣ ਜਾਂ ਘਟਾਉਣ ਲਈ ਟੀਕਾਕਰਣ ਇੱਕ ਹੋਰ ਵਿਕਲਪ ਹੈ।';

  @override
  String get sprevent => '\n\n ਰੋਕਥਾਮ ਲਈ ਸਾਵਧਾਨੀਆਂ \n\n ਪੋਲਟਰੀ ਵਿੱਚ ਸਾਲਮੋਨੇਲਾ ਦੇ ਜੋਖਮ ਨੂੰ ਰੋਕਣ ਜਾਂ ਘਟਾਉਣ ਲਈ ਕੁਝ ਸਾਵਧਾਨੀਆਂ ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਭੋਜਨ ਨੂੰ ਸੰਭਾਲਣ ਤੋਂ ਪਹਿਲਾਂ ਅਤੇ ਬਾਅਦ ਵਿੱਚ ਹੱਥ ਧੋਣਾ, ਭੋਜਨ ਨੂੰ ਚੰਗੀ ਤਰ੍ਹਾਂ ਪਕਾਉਣਾ, ਕੱਚੇ ਜਾਂ ਘੱਟ ਪਕਾਏ ਅੰਡੇ ਅਤੇ ਮੀਟ ਤੋਂ ਪਰਹੇਜ਼ ਕਰਨਾ, ਭੋਜਨ ਨੂੰ ਤੁਰੰਤ ਫਰਿੱਜ ਵਿੱਚ ਰੱਖਣਾ, ਅਤੇ ਬਿਮਾਰ ਜਾਨਵਰਾਂ ਜਾਂ ਲੋਕਾਂ ਨਾਲ ਸੰਪਰਕ ਤੋਂ ਪਰਹੇਜ਼ ਕਰਨਾ।';

  @override
  String get snote => '\n\n ਨੋਟ: \n\n ਕੁਝ ਰੋਕਥਾਮ ਉਪਾਵਾਂ ਜੋ ਮਨੁੱਖਾਂ ਨੂੰ ਪੋਲਟਰੀ ਤੋਂ ਸੈਲਮੋਨੇਲਾ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਨਾ ਹੋਣ ਲਈ ਕਰਨੀਆਂ ਚਾਹੀਦੀਆਂ ਹਨ, ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਪੋਲਟਰੀ ਜਾਂ ਉਨ੍ਹਾਂ ਦੇ ਆਂਡਿਆਂ ਨੂੰ ਛੂਹਣ ਤੋਂ ਬਾਅਦ ਹੱਥ ਧੋਣਾ, ਪੋਲਟਰੀ ਅਤੇ ਉਨ੍ਹਾਂ ਦੇ ਆਂਡਿਆਂ ਨੂੰ ਹੋਰ ਭੋਜਨਾਂ ਤੋਂ ਵੱਖ ਰੱਖਣਾ, ਪੋਲਟਰੀ ਅਤੇ ਅੰਡੇ ਪਕਾਉਣਾ ਇੱਕ ਸੁਰੱਖਿਅਤ ਅੰਦਰੂਨੀ ਤਾਪਮਾਨ ਤੱਕ, ਅਤੇ ਕਿਸੇ ਵੀ ਫਟੇ ਜਾਂ ਗੰਦੇ ਅੰਡੇ ਨੂੰ ਛੱਡਣਾ।';

  @override
  String get habout => 'ਸਿਹਤਮੰਦ ਪੋਲਟਰੀ ਉਹ ਪੰਛੀ ਹੁੰਦੇ ਹਨ ਜੋ ਬਿਮਾਰੀਆਂ, ਪਰਜੀਵੀਆਂ ਅਤੇ ਸੱਟਾਂ ਤੋਂ ਮੁਕਤ ਹੁੰਦੇ ਹਨ। ਉਨ੍ਹਾਂ ਕੋਲ ਸਰੀਰ ਦੀ ਚੰਗੀ ਸਥਿਤੀ, ਖੰਭਾਂ ਦੀ ਗੁਣਵੱਤਾ ਅਤੇ ਭੁੱਖ ਹੈ। ਉਹ ਉੱਚ ਗੁਣਵੱਤਾ ਅਤੇ ਮਾਤਰਾ ਦੇ ਅੰਡੇ ਜਾਂ ਮੀਟ ਪੈਦਾ ਕਰਦੇ ਹਨ।';

  @override
  String get hothersymptoms => '\n\n ਹੋਰ ਲੱਛਣ \n\n ਸਿਹਤਮੰਦ ਪੋਲਟਰੀ ਬਿਮਾਰੀ ਜਾਂ ਪ੍ਰੇਸ਼ਾਨੀ ਦੇ ਕੋਈ ਲੱਛਣ ਨਹੀਂ ਦਿਖਾਉਂਦੀ, ਜਿਵੇਂ ਕਿ ਖੰਘ, ਛਿੱਕ, ਦਸਤ, ਟੱਟੀ ਵਿੱਚ ਖੂਨ, ਰਫਲਦਾਰ ਖੰਭ, ਹੱਡਲਿੰਗ, ਡਿਪਰੈਸ਼ਨ, ਜਾਂ ਅੰਡੇ ਦੇ ਉਤਪਾਦਨ ਵਿੱਚ ਕਮੀ। ਉਹ ਸੁਚੇਤ, ਸਰਗਰਮ ਅਤੇ ਵੋਕਲ ਹਨ।';

  @override
  String get hcure => '\n\n ਸਿਹਤਮੰਦ ਪੋਲਟਰੀ ਨੂੰ ਕਿਸੇ ਖਾਸ ਇਲਾਜ ਦੀ ਲੋੜ ਨਹੀਂ ਹੈ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਨਿਯਮਤ ਸਿਹਤ ਜਾਂਚਾਂ, ਕੀੜੇ ਮਾਰਨ ਅਤੇ ਟੀਕਾਕਰਨ ਤੋਂ ਲਾਭ ਹੋ ਸਕਦਾ ਹੈ। ਇਹ ਬਿਮਾਰੀਆਂ ਅਤੇ ਪਰਜੀਵੀਆਂ ਦੇ ਜੋਖਮ ਨੂੰ ਰੋਕਣ ਜਾਂ ਘਟਾਉਣ ਵਿੱਚ ਮਦਦ ਕਰ ਸਕਦੇ ਹਨ।';

  @override
  String get hprevent => '\n\n ਸਿਹਤਮੰਦ ਪੋਲਟਰੀ ਨੂੰ ਸਾਫ਼, ਸੁੱਕੇ ਅਤੇ ਚੰਗੀ ਤਰ੍ਹਾਂ ਹਵਾਦਾਰ ਵਾਤਾਵਰਨ ਵਿੱਚ ਰੱਖਿਆ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ, ਜਿਸ ਵਿੱਚ ਲੋੜੀਂਦੀ ਜਗ੍ਹਾ, ਫੀਡ ਅਤੇ ਪਾਣੀ ਹੋਵੇ। ਉਹਨਾਂ ਨੂੰ ਸ਼ਿਕਾਰੀਆਂ, ਕੀੜਿਆਂ ਅਤੇ ਅਤਿਅੰਤ ਮੌਸਮ ਤੋਂ ਸੁਰੱਖਿਅਤ ਰੱਖਿਆ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ। ਉਨ੍ਹਾਂ ਨੂੰ ਬਿਮਾਰ ਜਾਂ ਨਵੇਂ ਪੰਛੀਆਂ ਤੋਂ ਵੱਖ ਕੀਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ, ਅਤੇ ਕਿਸੇ ਵੀ ਮਰੇ ਜਾਂ ਬਿਮਾਰ ਪੰਛੀਆਂ ਨੂੰ ਹਟਾ ਦਿੱਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ ਅਤੇ ਸਹੀ ਢੰਗ ਨਾਲ ਨਿਪਟਾਇਆ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ।';

  @override
  String get hnote => '\n\n ਨੋਟ: \nਤੰਦਰੁਸਤ ਪੋਲਟਰੀ ਨੂੰ ਲੋੜ ਪੈਣ \'ਤੇ ਪੂਰਕਾਂ ਦੇ ਨਾਲ ਸੰਤੁਲਿਤ ਅਤੇ ਪੌਸ਼ਟਿਕ ਖੁਰਾਕ ਦਿੱਤੀ ਜਾਣੀ ਚਾਹੀਦੀ ਹੈ। ਉਨ੍ਹਾਂ ਨੂੰ ਸਾਫ਼ ਅਤੇ ਤਾਜ਼ਾ ਪਾਣੀ ਦੇਣਾ ਚਾਹੀਦਾ ਹੈ, ਅਤੇ ਦੂਸ਼ਿਤ ਭੋਜਨ ਜਾਂ ਪਾਣੀ ਤੋਂ ਬਚਣਾ ਚਾਹੀਦਾ ਹੈ। ਉਹਨਾਂ ਨੂੰ ਆਮ ਬਿਮਾਰੀਆਂ ਦੇ ਵਿਰੁੱਧ ਟੀਕਾਕਰਨ ਕੀਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ, ਅਤੇ ਜੇ ਲੋੜ ਹੋਵੇ ਤਾਂ ਪਰਜੀਵੀਆਂ ਦਾ ਇਲਾਜ ਕੀਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ। ਉਹਨਾਂ ਨੂੰ ਦੇਖਭਾਲ ਅਤੇ ਸਫਾਈ ਨਾਲ ਵੀ ਸੰਭਾਲਿਆ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ, ਅਤੇ ਤਣਾਅ ਅਤੇ ਸੱਟ ਤੋਂ ਬਚਣਾ ਚਾਹੀਦਾ ਹੈ।';

  @override
  String get nabout => 'ਨਿਊਕੈਸਲ ਦੀ ਬਿਮਾਰੀ ਏਵੀਅਨ ਪੈਰਾਮਾਈਕਸੋਵਾਇਰਸ ਕਿਸਮ 1 ਦੇ ਜ਼ਹਿਰੀਲੇ ਤਣਾਅ ਕਾਰਨ ਪੋਲਟਰੀ ਦੀ ਇੱਕ ਗੰਭੀਰ, ਪ੍ਰਣਾਲੀਗਤ ਅਤੇ ਘਾਤਕ ਵਾਇਰਲ ਬਿਮਾਰੀ ਹੈ। ਅਣ-ਟੀਕੇ ਵਾਲੇ ਪੰਛੀਆਂ ਵਿੱਚ ਕਲੀਨਿਕਲ ਸੰਕੇਤਾਂ ਵਿੱਚ ਅਚਾਨਕ ਮੌਤ, ਸੁਸਤੀ ਅਤੇ ਸਾਹ ਲੈਣ ਵਿੱਚ ਤਕਲੀਫ਼ ਸ਼ਾਮਲ ਹਨ। ਨਿਦਾਨ ਪ੍ਰਯੋਗਸ਼ਾਲਾ ਦੀ ਪੁਸ਼ਟੀ \'ਤੇ ਆਧਾਰਿਤ ਹੈ.';

  @override
  String get nothersymptoms => '\n\n ਹੋਰ ਲੱਛਣ \n\n ਨਿਊਕੈਸਲ ਬਿਮਾਰੀ ਦੇ ਕੁਝ ਹੋਰ ਲੱਛਣਾਂ ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਖੰਘਣਾ, ਛਿੱਕਣਾ, ਗੂੰਜਣਾ, ਧੜਕਣਾ, ਕੰਬਣਾ, ਅਧਰੰਗ, ਗਰਦਨ ਦਾ ਮਰੋੜਨਾ, ਪਾਣੀ ਵਾਲਾ ਮਲ, ਉਦਾਸੀ, ਭੁੱਖ ਦੀ ਕਮੀ, ਅਤੇ ਅੰਡੇ ਦੇ ਉਤਪਾਦਨ ਅਤੇ ਗੁਣਵੱਤਾ ਵਿੱਚ ਕਮੀ। .';

  @override
  String get ncure => '\n\n ਇਲਾਜ \n\n ਨਿਊਕੈਸਲ ਬਿਮਾਰੀ ਦਾ ਕੋਈ ਇਲਾਜ ਨਹੀਂ ਹੈ, ਅਤੇ ਪ੍ਰਕੋਪ ਦੇ ਨੇੜੇ-ਤੇੜੇ ਸੰਕਰਮਿਤ ਅਤੇ ਸੰਵੇਦਨਸ਼ੀਲ ਪੰਛੀਆਂ ਨੂੰ ਬਿਮਾਰੀ ਦੇ ਸੰਚਾਰ ਨੂੰ ਰੋਕਣ ਲਈ ਮਾਰਿਆ ਜਾਂਦਾ ਹੈ। ਝੁੰਡ ਨੂੰ ਬਿਮਾਰੀ ਤੋਂ ਬਚਾਉਣ ਲਈ ਟੀਕਾਕਰਨ ਸਭ ਤੋਂ ਵਧੀਆ ਤਰੀਕਾ ਹੈ।';

  @override
  String get nprevent => '\n\n ਰੋਕਥਾਮ ਲਈ ਸਾਵਧਾਨੀਆਂ \n\n ਨਿਊਕੈਸਲ ਬਿਮਾਰੀ ਨੂੰ ਰੋਕਣ ਜਾਂ ਨਿਯੰਤਰਿਤ ਕਰਨ ਲਈ ਕੁਝ ਸਾਵਧਾਨੀਆਂ ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਫਾਰਮ \'ਤੇ ਸਖਤ ਜੈਵਿਕ ਸੁਰੱਖਿਆ ਦਾ ਅਭਿਆਸ ਕਰਨਾ, ਨਵੇਂ ਜਾਂ ਬਿਮਾਰ ਪੰਛੀਆਂ ਨੂੰ ਅਲੱਗ ਕਰਨਾ, ਜੰਗਲੀ ਪੰਛੀਆਂ ਜਾਂ ਕਬੂਤਰਾਂ ਦੇ ਸੰਪਰਕ ਤੋਂ ਪਰਹੇਜ਼ ਕਰਨਾ, ਉਪਕਰਣਾਂ ਅਤੇ ਕਪੜਿਆਂ ਨੂੰ ਰੋਗਾਣੂ ਮੁਕਤ ਕਰਨਾ, ਅਤੇ ਕਿਸੇ ਦੀ ਰਿਪੋਰਟ ਕਰਨਾ। ਅਧਿਕਾਰੀਆਂ ਨੂੰ ਬਿਮਾਰੀ ਦਾ ਸ਼ੱਕ.';

  @override
  String get nnote => '\n\nਨੋਟ: \n\n ਕੁਝ ਰੋਕਥਾਮ ਉਪਾਵਾਂ ਜੋ ਮਨੁੱਖਾਂ ਨੂੰ ਪੋਲਟਰੀ ਤੋਂ ਨਿਊਕੈਸਲ ਬਿਮਾਰੀ ਤੋਂ ਪ੍ਰਭਾਵਿਤ ਨਾ ਹੋਣ ਲਈ ਕਰਨੀਆਂ ਚਾਹੀਦੀਆਂ ਹਨ, ਵਿੱਚ ਸ਼ਾਮਲ ਹਨ: ਬਿਮਾਰ ਜਾਂ ਮਰੇ ਹੋਏ ਪੰਛੀਆਂ ਨੂੰ ਸੰਭਾਲਣ ਵੇਲੇ ਸੁਰੱਖਿਆ ਵਾਲੇ ਕੱਪੜੇ ਅਤੇ ਦਸਤਾਨੇ ਪਹਿਨਣੇ, ਪੋਲਟਰੀ ਨਾਲ ਸੰਪਰਕ ਕਰਨ ਤੋਂ ਬਾਅਦ ਹੱਥ ਧੋਣੇ ਅਤੇ ਸੈਨੀਟਾਈਜ਼ਿੰਗ ਉਪਕਰਣ, ਅਤੇ ਜੇਕਰ ਪੋਲਟਰੀ ਦੇ ਸੰਪਰਕ ਵਿੱਚ ਆਉਣ ਤੋਂ ਬਾਅਦ ਫਲੂ ਵਰਗੇ ਲੱਛਣ ਪੈਦਾ ਹੁੰਦੇ ਹਨ ਤਾਂ ਡਾਕਟਰੀ ਸਹਾਇਤਾ ਲੈਣੀ।';
}
