import 'app_localizations.dart';

/// The translations for Hindi (`hi`).
class AppLocalizationsHi extends AppLocalizations {
  AppLocalizationsHi([String locale = 'hi']) : super(locale);

  @override
  String get homeHeading => 'हेनस्कैन';

  @override
  String get boxCContact => 'संपर्क';

  @override
  String get boxcontent => 'किसी भी पूछताछ या सहायता के लिए, कृपया बेझिझक ईमेल के माध्यम से हमसे संपर्क करें। हमारी टीम तुरंत आपसे संपर्क करेगी। हमारे ऐप का उपयोग करने के लिए धन्यवाद!';

  @override
  String get boxmailus => 'हमें मेल करें';

  @override
  String get boxcancel => 'बंद';

  @override
  String get homeBody1 => 'हेनस्कैन पोल्ट्री स्वास्थ्य प्रबंधन के लिए डिज़ाइन किया गया एक अभिनव ऐप है। यह कोक्सीडियोसिस, साल्मोनेला, न्यूकैसल रोग जैसी प्रचलित बीमारियों की भविष्यवाणी करने या पोल्ट्री की स्वास्थ्य स्थिति का आकलन करने के लिए मल छवि विश्लेषण का उपयोग करता है।';

  @override
  String get homeBody2 => 'हेनस्कैन का लक्ष्य पोल्ट्री किसानों और पशु चिकित्सकों को प्रारंभिक बीमारी का पता लगाने और सक्रिय पोल्ट्री स्वास्थ्य प्रबंधन के लिए एक सुलभ और कुशल उपकरण प्रदान करके सशक्त बनाना है।';

  @override
  String get homeBody3 => 'उपयोगकर्ता एक छवि कैप्चर करने के लिए क्लिक कर सकते हैं और तत्काल पूर्वानुमान प्राप्त कर सकते हैं, जो बीमारी का पता लगाने और निवारक उपायों के लिए एक सुव्यवस्थित अनुभव प्रदान करता है।';

  @override
  String get homeBody4 => 'ऐप का उपयोग कैसे करें';

  @override
  String get homeBody5 => '1. कैप्चर: मुर्गी के मल के नमूने की तस्वीर लेने के लिए कैमरा आइकन पर टैप करें';

  @override
  String get homeBody6 => '2. भविष्यवाणी: पोल्ट्री की स्वास्थ्य स्थिति के बारे में त्वरित विश्लेषण और भविष्यवाणी प्राप्त करने के लिए भविष्यवाणी बटन पर क्लिक करें';

  @override
  String get instructionScreenHeading => 'निर्देश';

  @override
  String get instructionScreenBody => '1. नीचे \'अगला\' बटन पर क्लिक करने पर, आपको एक स्क्रीन पर निर्देशित किया जाएगा जिसमें छवि कैप्चर करने के लिए एक कैमरा बटन या आपकी गैलरी से अपलोड करने का विकल्प होगा।\n\n 2. भविष्यवाणी सटीकता बढ़ाने के लिए, सुनिश्चित करें कि कैप्चर की गई या अपलोड की गई छवि में मल का स्थान फ़्रेम के भीतर केंद्रित है।\n\n 3. ध्यान दें कि यदि ऐप को गैर-मल छवि के साथ प्रस्तुत किया गया है, तो यह अभी भी एक भविष्यवाणी उत्पन्न कर सकता है, लेकिन सटीकता की गारंटी नहीं दी जा सकती है। विश्वसनीय बीमारी का पता लगाने के लिए उपयोगकर्ताओं को केवल पोल्ट्री मल की छवियां अपलोड करने के लिए दृढ़ता से प्रोत्साहित किया जाता है।';

  @override
  String get instructionScreenNext => 'अगला';

  @override
  String get clickImagePageHeading => 'कुक्कुट रोग की भविष्यवाणी करें';

  @override
  String get clickImage => 'पोल्ट्री मल छवि पर क्लिक करें';

  @override
  String get uploadimage => 'गैलरी से पोल्ट्री मल छवि का चयन करें';

  @override
  String get predictButton => 'भविष्यवाणी करना';

  @override
  String get pstitle => 'भविष्यवाणी';

  @override
  String get cabout => 'कोक्सीडियोसिस एक आंतों का संक्रमण है जो कोक्सीडिया नामक सूक्ष्म परजीवियों के कारण होता है। यह बिल्लियों, कुत्तों, पक्षियों और पशुओं सहित विभिन्न जानवरों को प्रभावित कर सकता है। इससे दस्त, वजन घटना, निर्जलीकरण और एनीमिया हो सकता है।';

  @override
  String get cothersymptoms => '\n\n अन्य लक्षण \n\n पक्षियों में कोसिडियोसिस के कुछ अन्य लक्षणों में शामिल हैं: मल में रक्त या बलगम, पेट में दर्द, उल्टी, बुखार, सुस्ती और कम भूख। लक्षण आमतौर पर एक्सपोज़र के बाद एक से तीन सप्ताह के भीतर दिखाई देते हैं और दो से चार सप्ताह तक रहते हैं।';

  @override
  String get ccure => '\n\nइलाज \n\nकोसिडियोसिस का कोई विशिष्ट इलाज नहीं है, लेकिन कुछ दवाएं संक्रमण की गंभीरता और अवधि को कम करने में मदद कर सकती हैं। इनमें सल्फोनामाइड्स, एम्प्रोलियम और टोलट्राज़ुरिल शामिल हैं। ये दवाएं आमतौर पर पांच से दस दिनों के लिए मौखिक रूप से दी जाती हैं।';

  @override
  String get cprevent => 'रोकथाम के लिए सावधानियां \n\n कोक्सीडायोसिस को रोकने या नियंत्रित करने के लिए कुछ सावधानियों में शामिल हैं: पर्यावरण को साफ और सूखा रखना, मल को तुरंत हटाना, पिंजरों और उपकरणों को कीटाणुरहित करना, ताजा पानी और भोजन प्रदान करना, भीड़भाड़ और तनाव से बचना और यदि उपलब्ध हो तो जानवरों का टीकाकरण करना।';

  @override
  String get cnote => '\n\n ध्यान दें: \n\n कुछ रोकथाम के उपाय जो मनुष्यों को पोल्ट्री से कोसिडियोसिस से प्रभावित नहीं होने के लिए करने चाहिए उनमें शामिल हैं: पोल्ट्री घरों की सफाई करते समय दस्ताने और जूते पहनना, पोल्ट्री या उनके मल को संभालने के बाद हाथ धोना, पोल्ट्री मांस और अंडे पकाना पूरी तरह से, और बीमार या मृत पक्षियों के संपर्क से बचें।';

  @override
  String get sabout => '\n पोल्ट्री में साल्मोनेला एक जीवाणु संक्रमण है जो मुर्गियों और अन्य पक्षियों के आंत्र पथ को प्रभावित करता है। इससे दस्त, बुखार और अंडे का उत्पादन कम हो सकता है। यह दूषित अंडे या मांस के सेवन से भी मनुष्यों में फैल सकता है।';

  @override
  String get sothersymptoms => '\n\n अन्य लक्षण \n\n मुर्गियों में साल्मोनेला के कुछ अन्य लक्षणों में शामिल हैं: भूख में कमी, निर्जलीकरण, अवसाद, पंखों का झड़ना, झुंड बनाकर बैठना और मृत्यु दर में वृद्धि। लक्षण आमतौर पर एक्सपोज़र के 12 से 72 घंटों के भीतर दिखाई देते हैं और कई दिनों तक बने रहते हैं।';

  @override
  String get scure => '\n\n इलाज \n\n पोल्ट्री में साल्मोनेला का कोई विशिष्ट इलाज नहीं है, लेकिन कुछ एंटीबायोटिक्स संक्रमण की गंभीरता और अवधि को कम करने में मदद कर सकते हैं। हालाँकि, एंटीबायोटिक दवाओं का उपयोग सावधानी से किया जाना चाहिए, क्योंकि वे एंटीबायोटिक-प्रतिरोधी उपभेदों के विकास को भी बढ़ावा दे सकते हैं। पोल्ट्री में साल्मोनेला की घटनाओं को रोकने या कम करने के लिए टीकाकरण एक अन्य विकल्प है।';

  @override
  String get sprevent => '\n\n रोकथाम के लिए सावधानियां \n\n पोल्ट्री में साल्मोनेला के खतरे को रोकने या कम करने के लिए कुछ सावधानियों में शामिल हैं: भोजन को संभालने से पहले और बाद में हाथ धोना, भोजन को अच्छी तरह से पकाना, कच्चे या अधपके अंडे और मांस से परहेज करना, भोजन को तुरंत फ्रिज में रखना, और बीमार जानवरों या लोगों के संपर्क से बचना।';

  @override
  String get snote => '\n\n ध्यान दें: \n\n कुछ रोकथाम के उपाय जो मनुष्यों को पोल्ट्री से साल्मोनेला से प्रभावित नहीं होने के लिए करने चाहिए उनमें शामिल हैं: पोल्ट्री या उनके अंडों को छूने के बाद हाथ धोना, पोल्ट्री और उनके अंडों को अन्य खाद्य पदार्थों से अलग रखना, पोल्ट्री और अंडों को पकाना एक सुरक्षित आंतरिक तापमान पर, और किसी भी टूटे हुए या गंदे अंडे को हटा दें।';

  @override
  String get habout => 'स्वस्थ पोल्ट्री वे पक्षी हैं जो बीमारियों, परजीवियों और चोटों से मुक्त होते हैं। उनके शरीर की स्थिति, पंखों की गुणवत्ता और भूख अच्छी होती है। वे उच्च गुणवत्ता और मात्रा के अंडे या मांस का उत्पादन करते हैं।';

  @override
  String get hothersymptoms => '\n\n अन्य लक्षण \n\n स्वस्थ मुर्गों में बीमारी या संकट के कोई लक्षण नहीं दिखते, जैसे खांसी, छींक आना, दस्त, मल में खून, उलझे हुए पंख, भीड़-भाड़, अवसाद, या अंडे का उत्पादन कम होना। वे सतर्क, सक्रिय और मुखर हैं।';

  @override
  String get hcure => '\n\nस्वस्थ मुर्गे को किसी विशिष्ट इलाज की आवश्यकता नहीं होती है, लेकिन उन्हें नियमित स्वास्थ्य जांच, कृमि मुक्ति और टीकाकरण से लाभ हो सकता है। ये बीमारियों और परजीवियों के जोखिम को रोकने या कम करने में मदद कर सकते हैं।';

  @override
  String get hprevent => '\n\nस्वस्थ मुर्गे को पर्याप्त जगह, चारा और पानी के साथ साफ, सूखे और हवादार वातावरण में रखा जाना चाहिए। उन्हें शिकारियों, कीटों और चरम मौसम से बचाया जाना चाहिए। उन्हें बीमार या नए पक्षियों से अलग किया जाना चाहिए, और किसी भी मृत या रोगग्रस्त पक्षी को हटा दिया जाना चाहिए और उचित तरीके से निपटान किया जाना चाहिए।';

  @override
  String get hnote => '\n\nध्यान दें: \nस्वस्थ मुर्गे को संतुलित और पौष्टिक आहार दिया जाना चाहिए, यदि आवश्यक हो तो पूरक के साथ। उन्हें साफ़ और ताज़ा पानी दिया जाना चाहिए और दूषित भोजन या पानी से बचना चाहिए। उन्हें सामान्य बीमारियों के खिलाफ टीका लगाया जाना चाहिए, और यदि आवश्यक हो तो परजीवियों का इलाज किया जाना चाहिए। उन्हें भी देखभाल और स्वच्छता के साथ संभाला जाना चाहिए, और तनाव और चोट से बचना चाहिए।';

  @override
  String get nabout => 'न्यूकैसल रोग, एवियन पैरामाइक्सोवायरस प्रकार 1 के विषैले उपभेदों के कारण मुर्गी पालन की एक गंभीर, प्रणालीगत और घातक वायरल बीमारी है। बिना टीकाकरण वाले पक्षियों में नैदानिक लक्षणों में अचानक मृत्यु, सुस्ती और श्वसन संकट शामिल हैं। निदान प्रयोगशाला पुष्टि पर आधारित है।';

  @override
  String get nothersymptoms => '\n\n अन्य लक्षण \n\n न्यूकैसल रोग के कुछ अन्य लक्षणों में शामिल हैं: खांसी, छींक आना, गड़गड़ाहट, खड़खड़ाहट, कंपकंपी, पक्षाघात, गर्दन का मुड़ना, पानी जैसा मल, अवसाद, भूख न लगना और अंडे के उत्पादन और गुणवत्ता में कमी .';

  @override
  String get ncure => '\n\n इलाज \n\n न्यूकैसल रोग का कोई इलाज नहीं है, और रोग के संचरण को रोकने के लिए प्रकोप के आसपास के संक्रमित और अतिसंवेदनशील पक्षियों को मार दिया जाता है। झुंड को बीमारी से बचाने के लिए टीकाकरण सबसे अच्छा तरीका है।';

  @override
  String get nprevent => '\n\n रोकथाम के लिए सावधानियां \n\n न्यूकैसल रोग को रोकने या नियंत्रित करने के लिए कुछ सावधानियों में शामिल हैं: खेत पर सख्त जैव सुरक्षा का अभ्यास करना, नए या बीमार पक्षियों को अलग करना, जंगली पक्षियों या कबूतरों के संपर्क से बचना, उपकरण और कपड़ों कीटाणुरहित करना, और अधिकारियों को बीमारी के किसी भी संदेह की रिपोर्ट करना।';

  @override
  String get nnote => '\n\nध्यान दें: \n\n कुछ रोकथाम के उपाय जो मनुष्यों को पोल्ट्री से होने वाले न्यूकैसल रोग से प्रभावित न होने के लिए करने चाहिए उनमें शामिल हैं: बीमार या मृत पक्षियों को संभालते समय सुरक्षात्मक कपड़े और दस्ताने पहनना, पोल्ट्री के संपर्क के बाद हाथ धोना और उपकरणों को साफ करना, और यदि मुर्गीपालन के संपर्क में आने के बाद कोई फ्लू जैसे लक्षण विकसित होते हैं तो चिकित्सा सहायता लें।';
}
